

# מציאת הנקודה על העקומה במיקום t
# זוהי נוסחת פולינומי ברנשטיין. הפונקציה מחשבת את הנקודות על פי נקודות הבקרה המושכות את העקומה. בכל מיקום t, לכל נקודת בקרה יש עוצמה אחרת
def q(ctrlPoly, t):
    return (1.0-t)**3 * ctrlPoly[0] + 3*(1.0-t)**2 * t * ctrlPoly[1] + 3*(1.0-t)* t**2 * ctrlPoly[2] + t**3 * ctrlPoly[3]


# חישוב הנגזרת הראשונה של עקומת בזייה(נוסחת ברנשטיין). הנגזרת אומרת לנו מה כיוון התנועה במיקום t ומה המהירות.
def qprime(ctrlPoly, t):
    return 3*(1.0-t)**2 * (ctrlPoly[1]-ctrlPoly[0]) + 6*(1.0-t) * t * (ctrlPoly[2]-ctrlPoly[1]) + 3*t**2 * (ctrlPoly[3]-ctrlPoly[2])


#  חישוב הנגזרת השנייה (עקמומיות). היא עוזרת לניוטון-רפסון להבין כמה המשיק משנה את הזווית שלו כדי לדעת כמה תיקון צריך לעשות ל-t כדי להתקרב לנקודה
def qprimeprime(ctrlPoly, t):
    return 6*(1.0-t) * (ctrlPoly[2]-2*ctrlPoly[1]+ctrlPoly[0]) + 6*(t) * (ctrlPoly[3]-2*ctrlPoly[2]+ctrlPoly[1])


